testCases/otherCases/03_add_models_for_solid_body/I_addModel_RepeatSamePosition/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     HFDIBDEMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;
// stopAt          writeNow;

endTime         0.001;

deltaT          0.00025;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

maxCo           1.0;

maxDeltaT       0.001;

adjustTimeStep  no;

runTimeModifiable yes;

writeCompression off;

// ************************************************************************* //
